Tekla Open API Reference for Tekla Structures 2025
ConnectiveGeometryException.OperationStatus Field
 Possible error statuses for geometry creation/modification commands.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public readonly BentPlateGeometrySolver.OperationStatus OperationStatus
Public ReadOnly OperationStatus As BentPlateGeometrySolver.OperationStatus
Field Value
Type: BentPlateGeometrySolver.OperationStatus
See Also
Reference
ConnectiveGeometryException Class
Tekla.Structures.Model Namespace